app/Controllers/Front/Home.php

	public function index()
	{
		$post = model('PostModel');
		helper('text');
		return view('Front/Home', [
			'posts' => $post->published()->orderBy('published_at', 'desc')->paginate(2),
			'pager' => $post->pager,
		]);
---
SELECT *
FROM `posts`
WHERE `published_at` <= '2023-12-05 14:38:14'
ORDER BY `published_at` DESC
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `published_at` <= '2023-12-05 14:38:14'