app/Controllers/Auth/Register.php

SELECT *
FROM `countries`
---
    public function index(){
        $model = model('CountriesModel');
        return view('Auth/register', [
            'countries' => $model->findAll()
        ]);

INSERT INTO `users` (`email`, `password`, `username`, `created_at`, `updated_at`, `group`) VALUES ('amhir@gmail.com', '$2y$10$bLturPa/YwzPd06UdfigOOhs7svVdGzUbfOsNTi5k4VyZ/yOiSUii', 'AmhirRomero', '2023-12-05 14:39:09', '2023-12-05 14:39:09', '2')
---
    public function store(){

        $validation = service('validation');
        $validation -> setRules ([
        'name' => 'required|alpha_space',
        'surname' => 'required|alpha_space',
        'email' => 'required|valid_email|is_unique [users.email]',
        'id_country' => 'required|is_not_unique [countries.id_country]',
        'password' =>'required|matches[c-password]'
    ]);

    if($validation->withRequest($this->request)->run()){
        return redirect()->back()->withInput()->with('errors', $validation->getErrors());
    }

        $user = new User($this->request->getPost()); //retorno de valores del post
        $user->generateUsername();

        $model = model('UsersModel');
        $model->withGroup(config('ayudar')->$defaultGroupUsers);

        $userInfo = new UserInfo($this->request->getPost());
        $model->addInfoUser($userInfo);

        $model->save($user);