app/Entities/Post.php

SELECT *
FROM `categories_posts`
JOIN `categories` ON `categories`.`id` = `categories_posts`.`id_category`
WHERE `id_post` = '1'
---
	public function getCategories(){
		$cpModel = model('Categoriesposts');
		return $cpModel->where('id_post', $this->id)->join('categories', 'categories.id = categories_posts.id_category')->findAll() ?? [];