app/Entities/User.php

    public function getRole(){
        $model = model('GroupsModel');
        return $model->where('id_group', $this->group)->first();
---
SELECT *
FROM `groups`
WHERE `id_group` = '1'
AND `groups`.`deleted_at` IS NULL
 LIMIT 1