app/Models/UsersModel.php

SELECT *
FROM `groups`
WHERE `name_group` = 'user'
---
    public function withGroup(string $group){
        $row = $this->db->table('groups')
                ->where('name_group',$group)
                ->get()->getFirstRow();